"""Тесты модуля utils.py"""

import pytest

from src.utils import greeting


@pytest.mark.parametrize(
    "time_str, expected",
    [
        ("2026-07-22 05:59:59", "Доброй ночи!"),
        ("2026-07-22 06:00:00", "Доброе утро!"),
        ("2026-07-22 11:59:59", "Доброе утро!"),
        ("2026-07-22 12:00:00", "Добрый день!"),
        ("2026-07-22 17:59:59", "Добрый день!"),
        ("2026-07-22 18:00:00", "Добрый вечер!"),
        ("2026-07-22 22:59:59", "Добрый вечер!"),
        ("2026-07-22 23:00:00", "Доброй ночи!"),
        ("20267-22 23:00:00", "Здравствуйте!"),
        ("2026-07-22 23:00", "Здравствуйте!"),
    ],
)
def test_greeting_edge_cases(time_str: str, expected: str) -> None:
    """Тест: граничные значения времени"""
    assert greeting(time_str) == expected


def test_greeting_morning() -> None:
    """Тест функции приветствия greeting() -> Доброе утро!"""

    assert greeting("2026-07-22 06:00:00") == "Доброе утро!"
    assert greeting("2026-07-22 08:30:15") == "Доброе утро!"
    assert greeting("2026-07-22 11:59:59") == "Доброе утро!"


def test_greeting_day() -> None:
    """Тест функции приветствия greeting() -> Добрый день!"""

    assert greeting("2026-07-22 12:00:00") == "Добрый день!"
    assert greeting("2026-07-22 15:30:15") == "Добрый день!"
    assert greeting("2026-07-22 17:59:59") == "Добрый день!"


def test_greeting_evening() -> None:
    """Тест функции приветствия greeting() -> Добрый вечер!"""

    assert greeting("2026-07-22 18:00:00") == "Добрый вечер!"
    assert greeting("2026-07-22 20:30:00") == "Добрый вечер!"
    assert greeting("2026-07-22 22:59:59") == "Добрый вечер!"


def test_greeting_night() -> None:
    """Тест функции приветствия greeting() -> Доброй ночи"""

    assert greeting("2026-07-22 23:00:00") == "Доброй ночи!"
    assert greeting("2026-07-22 00:30:00") == "Доброй ночи!"
    assert greeting("2026-07-22 05:59:59") == "Доброй ночи!"


def test_greeting_exp() -> None:
    """Тест функции приветствия greeting() - исключение -> Здравствуйте!"""

    assert greeting("2-02607-22 06:00:00") == "Здравствуйте!"
    assert greeting("2026-07gu-22 08:30:00") == "Здравствуйте!"
    assert greeting("2026-07-2q 11:59:59") == "Здравствуйте!"
    assert greeting("") == "Здравствуйте!"
